<template>
  <Suspense>
    <template #default>
      <div class="">
        <!-- <TheViewContent 
          title="«Кыргызтест» – ОшМУ: Кызматташуунун иштиктүү кадамдары"
          content="kalys Lorem <h1>ipsum dolor</h1> sit, amet consectetur adipisicing elit. Iusto accusantium, nisi vel laborum dolorum facere illo quas voluptate harum exercitationem! psum dolor sit, amet consectetur adipisicing elit. Iusto accusantium, nisi vel laborum dolorum facere illo quas voluptate harum exercitationem!Государственное учреждение «Кыргызтест» провело выездное мобильное тестирование по определению уровня владения государственным языком среди государственных и муниципальных служащих Иссык-Кульской области, которое состоялось с 19 декабря 2022 года по 24 декабря 2022 года. В тестировании принимали участие работники различных организации и учреждений Жеты-Огузского и Тюпского районов. В Бишкеке также проходило тестирование по определению уровня владения государственным языком среди государственных и муниципальных служащих и для претендентов на гражданство Кыргызской Республики. Общей количество участвовавших в тестировании 365 человек."
        /> -->
        <h2 class="flex justify-center mb-[50px] md:mb-[100px] text-xl font-bold sm:text-4xl">«Кыргызтест» – ОшМУ: Кызматташуунун иштиктүү кадамдары</h2>
        <div class="text-md">
          <p class="mb-24 md:mb-32 leading-9">
            «Кыргызтест» мамлекеттик мекемесинде 2022-жылда аткарылган иштердин жыйынтыктыгын чыгаруу боюнча жыйын өтүп, төмөндөгүлөр белгиленди:
            2022–жылы мамлекеттик тилди билүү деңгээлин баалоо тестине жалпысынан 6 799 адам катышкандыгы;
            2022-жылы «Кыргызтест» мамлекеттик мекемесинде жаңы багыттагы тесттер киргизилгендиги:
            окумуштуулук даражаны изденип алуучулар үчүн мамлекеттик тилди билүү деңгээлин баалоо боюнча;
            Кыргыз Республикасынын жарандыгын алууну көздөгөн чет элдиктер үчүн А1 деңгээлинен ТРКО боюнча тесттер.
            Көчмө топто жүргүзүлгөн мобилдик тесттерге 2022-жылы Ош, Жалал-Абад, Нарын, Талас жана Ысык-Көл облустарында 3020 адам катышкандыгы;
            Онлайн тесттери уюштурулуп, Кыргыз Республикасынын Австрия, Улуу Британия, Венгрия, Германия, Казакстан, Катар, Кытай, Бириккен Араб Эмирликтери, Пакистан, Россия Федерациясы, Сауд Арабиясы, АКШ, Тажикстан, Швейцария жана Япония мамлекеттериндеги элчиликтеринин жана өкүлчүлүктөрүнүн кызматкерлери онлайн тестке катышкандыгы;
            Мамлекеттик тилдин бир айлыгынын алкагында кыргыз тилин үйрөнүүгө кызыгууну арттыруу максатында бир катар министрликтерде жат жазуу өнөктүгү өткөндүгү жана «Бишкек парк» соода борборунда, «Манас» аэропортунда, Чүй мамлекеттик университетинде флешмобдор (чакан тесттер) уюштурулгандыгы.
            Мекеменин иши жалпысынан канааттандырарлык деп бааланып, жыйындын соңунда 2023-жылга каралган өнүгүү планы талкууланды, иштин негизги багыттары белгиленди.
          </p>
          <div class="grid grid-cols-1 md:grid-cols-2 gap-5">
            <img class="rounded-md" src="https://kyrgyztest.gov.kg/wp-content/uploads/2023/01/MG_3939-1536x1024.jpg" alt="">
            <img class="rounded-md"  src="https://kyrgyztest.gov.kg/wp-content/uploads/2023/01/MG_4159-1536x1024.jpg" alt="">
            <img class="rounded-md"  src="https://kyrgyztest.gov.kg/wp-content/uploads/2023/01/0a60a8d5-ba04-4808-a0c5-2889dbbc500d-1-scaled-1-1536x864.jpg" alt="">
            <img class="rounded-md"  src="https://kyrgyztest.gov.kg/wp-content/uploads/2023/01/IMG_20220828_125743-1-scaled-1-1536x692.jpg" alt="">
            <img class="rounded-md"  src="https://kyrgyztest.gov.kg/wp-content/uploads/2023/01/121121.png" alt="">
          </div>
        </div>
      </div>
    </template>
    <template #fallback>
      <div class="flex justify-center items-center">Loading...</div>
    </template>
  </Suspense>
  
</template>

<script lang="ts" setup>
import TheViewContent from "@/components/TheViewContent.vue"

</script>
